cricket2009/SpO2_MSP430/MSP430F5528/AFE44x0_main.c
        }
        
        receiveFlag = 0;
      }
      break;
  }
}

// Port 2 interrupt service routine 采样频率为80Hz，也就是每1/80s进入一次中断
#pragma vector=PORT2_VECTOR  //DRDY interrupt
__interrupt void Port_2(void)
{
  
  switch (P2IV)
  {
  case P2IV_P2IFG2:   
    P2IFG &= ~BIT2;                                   // Clear P2.2 IFG i.e Data RDY interrupt status
    //P5OUT |= BIT0;                                  //Turn on LED P5.0 (Green)
    readDataFlag = 1;                                 // Set Flag to read AFE44x0 ADC REG data
    //计算SPO2和HR的值
    Cal_spo2_and_HR();                                // 每进一次中断，计算一次
    break;
    
  case P2IV_NONE:
    break;
  }
}
// Port 1 按键中断服务函数 ,P1.6
#pragma vector=PORT1_VECTOR  //DRDY interrupt
__interrupt void Port_1(void)
{
  P2IE &= ~BIT2;                        
  switch (P1IV)
  {
  case P1IV_P1IFG6:
    P1IE &= ~BIT6;               // P1.7 interrupt DISABLE
    Device_waite_time1 = 0;  // 等待状态计数值清0
    Finger_out_num = 0;      // 计数器状态清0
    writeNum = 0;            // 初始化写入次数
    if(SpO2SystemStatus == SpO2_ON_SLEEP || SpO2SystemStatus == SpO2_OFF_SLEEP)//处于睡眠态，长按短按都是进入等待态，只有离线状态才能进入等待状态
    {
      OLED_ShowString(0,30,32,"        ");  //8个空格，完全清空
      if(SpO2SystemStatus == SpO2_OFF_SLEEP)   // 离线测量状态切换到离线空闲
      {
        SpO2SystemStatus = SpO2_OFFLINE_IDLE;
        Show_Wait_Symbol("Off-IDLE");
      }
      else if(SpO2SystemStatus == SpO2_ON_SLEEP) // 在线测量状态切换到在线空闲
      {
        SpO2SystemStatus = SpO2_ONLINE_IDLE;
        Show_Wait_Symbol("On-IDLE ");
      }
      LPM3_EXIT;
      OLED_ShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //清空心型图标
      OLED_Refresh_Gram();
    }
    else    //处于等待状态或是测量状态有按键按下
    {
      int Press_type = 0;       //0表示短按，1表示长按
      //判断是长按还是短按
      for(Press_type = 0;Press_type < 1000; Press_type++)//16Mhz下 约1.22s
      {
        if(P1IN&BIT6)    //P1.6是高电平，表示松开按键
          break;
        delay(2000);
      }
      if(Press_type != 1000)    //短按
        Press_type = 0;
      else
        Press_type = 1;         //长按
      
      
      switch(SpO2SystemStatus)
      {
          case SpO2_OFFLINE_IDLE: // 离线等待状态
            if(Press_type == 0)//短按，开始测量
            {      
              SpO2SystemStatus = SpO2_OFFLINE_MEASURE;
              OLED_ShowString(SPO2_Symbol_Start_X,0,12,"Off_Go  ");
              OLED_Refresh_Gram();
              //打开AFE4400
              AFE44xx_PowerOn();
              //打开AFE4400的中断
              Enable_AFE44xx_DRDY_Interrupt();
              //打开定时器中断
              //TA1CCTL0 |= CCIE;
            }
            else//长按，关屏
              SpO2SystemStatus = SpO2_OFF_SLEEP; 
            break;
          
          case SpO2_ONLINE_IDLE: // 处于在线等待状态
            if(Press_type == 0)//短按，开始测量
            {          
              SpO2SystemStatus = SpO2_ONLINE_MEASURE;
              OLED_ShowString(SPO2_Symbol_Start_X,0,12,"On_Go   ");
              OLED_Refresh_Gram();
              //打开AFE4400
              AFE44xx_PowerOn();
              //打开AFE4400的中断
              Enable_AFE44xx_DRDY_Interrupt();
              //打开定时器中断
              //TA1CCTL0 |= CCIE;
            }
            else//长按，关屏
              SpO2SystemStatus = SpO2_ON_SLEEP;
            break;
            
          case SpO2_OFFLINE_MEASURE: //处于离线测量状态
            if(Press_type == 0)//短按，停止测量
            {
              SpO2SystemStatus = SpO2_OFFLINE_IDLE;
              //关闭定时器中断
              // TA1CCTL0 &= ~CCIE;
              //关闭AFE4400的中断
              Disable_AFE44xx_DRDY_Interrupt();          
              //关闭AFE4400
              AFE44xx_PowerOff();
              OLED_ShowString(0,30,32,"        ");  //8个空格，完全清空
              Show_Wait_Symbol("Off_IDLE");
              OLED_ShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //清空心型图标
              OLED_Refresh_Gram();
            }
            else//长按，关屏
              SpO2SystemStatus = SpO2_OFF_SLEEP;
            break;
            
          case SpO2_ONLINE_MEASURE: // 处于在线测量状态
            if(Press_type == 0)//短按，停止测量
            {
              SpO2SystemStatus = SpO2_ONLINE_IDLE;
              //关闭定时器中断
              // TA1CCTL0 &= ~CCIE;
              //关闭AFE4400的中断
              Disable_AFE44xx_DRDY_Interrupt();          
              //关闭AFE4400
              AFE44xx_PowerOff();
              OLED_ShowString(0,30,32,"        ");  //8个空格，完全清空
              Show_Wait_Symbol("On_IDLE ");
              OLED_ShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //清空心型图标
              OLED_Refresh_Gram();
            }
            else//长按，关屏
              SpO2SystemStatus = SpO2_ON_SLEEP;
            break;

           default:break; // 其他状态直接退出，找网
      }
    }
    P1IFG &= ~BIT6;             // P1.6 IFG cleared
    P1IE |= BIT6;               // P1.7 interrupt enabled
    break;
    
  case P1IV_NONE:
    break;
  }
  P2IE |= BIT2;  
}
unsigned char ascii2uint8 (unsigned char asciiVal)
{
	unsigned char uint8Val;
	
	if (asciiVal > 0x60 && asciiVal < 0x67)			// 'a' to 'f'
		uint8Val = ((asciiVal - 0x61) + 0x0A);
  	else if (asciiVal > 0x40 && asciiVal < 0x47)		// 'A' to 'F'
  		uint8Val = ((asciiVal - 0x41) + 0x0A);
  	else if (asciiVal > 0x2F && asciiVal < 0x3A)		// '0' to '9'
  		uint8Val = (asciiVal - 0x30);
  	else												// others
  		uint8Val = 0;
  		
  	return uint8Val;
}




/*  
 * ======== init_UART  ========
 */
void Init_UART()
{
  P4SEL |= BIT4+BIT5;                        // P4.4,5 = USCI_A1 TXD/RXD
  //P4DIR |= BIT4;
  UCA1CTL1 |= UCSWRST;                       // **Put state machine in reset**
  UCA1CTL1 |= UCSSEL_1;                      // ACLK -- 16MHz
  UCA1MCTL |= UCOS16;                        // UCOS16 =1, oversampling mode
  
//  UCA1BR0 = 52;                            // 16MHz 19200 Buard rate (see User's Guide), 
//  UCA1BR1 = 0;                             // 16MHz 
//  UCA1MCTL |=  UCBRF_1;                    // Modulation UCBRSx=0, UCBRFx=1
    
  UCA1BR0 = 104;                             // 16MHz 9600 Buard rate (see User's Guide), 
  UCA1BR1 = 0; 
  
